[
    {
        "id": 1,
        "titulo": "Iphone 15 PRO",
        "descripcion": "El iPhone 15 Pro es el último modelo de teléfono inteligente de Apple, conocido por su potente rendimiento, cámara de alta calidad y diseño elegante. Presenta una pantalla OLED de alta resolución, un sistema de triple cámara mejorado y tecnología avanzada de reconocimiento facial.",
        "categoria": "celulares",
        "imagen": "/src/data/img/15pro.webp",
        "precio": 1150,
        "stock": 10
    },
    {
        "id": 2,
        "titulo": "Iphone 14 PRO",
        "descripcion": "El iPhone 14 Pro es un teléfono de gama alta que ofrece un rendimiento excepcional y características avanzadas. Destaca por su pantalla Super Retina XDR, potente chip A15 Bionic y capacidades de grabación de video de alta calidad.",
        "categoria": "celulares",
        "imagen": "/src/data/img/14pro.webp",
        "precio": 900,
        "stock": 10
    },
    {
        "id": 3,
        "titulo": "Iphone 13",
        "descripcion": "El iPhone 13 es un smartphone versátil y potente que ofrece una experiencia premium. Cuenta con una pantalla OLED brillante, un potente sistema de cámara dual o triple, y una batería de larga duración. Es conocido por su diseño elegante y duradero.",
        "categoria": "celulares",
        "imagen": "/src/data/img/13.webp",
        "precio": 700,
        "stock": 10
    },
    {
        "id": 4,
        "titulo": "Iphone 12",
        "descripcion": "El iPhone 12 es un dispositivo innovador que combina un diseño moderno con un rendimiento excepcional. Presenta una pantalla Super Retina XDR, un potente chip A14 Bionic y tecnología 5G para una conectividad rápida.",
        "categoria": "celulares",
        "imagen": "/src/data/img/12.webp",
        "precio": 520,
        "stock": 10
    },
    {
        "id": 5,
        "titulo": "Iphone 11",
        "descripcion": "El iPhone 11 es un smartphone popular conocido por su excelente relación calidad-precio. Ofrece un rendimiento sólido, una cámara dual avanzada y una duración de la batería impresionante. Es ideal para aquellos que buscan un dispositivo de alta calidad a un precio más accesible.",
        "categoria": "celulares",
        "imagen": "/src/data/img/11.webp",
        "precio": 450,
        "stock": 10
    },
    {
        "id": 6,
        "titulo": "Iphone XR",
        "descripcion": "El iPhone XR es un dispositivo que combina un rendimiento potente con un diseño colorido y moderno. Ofrece una pantalla Liquid Retina, una cámara de alta calidad y un rendimiento rápido gracias al chip A12 Bionic.",
        "categoria": "celulares",
        "imagen": "/src/data/img/xr.webp",
        "precio": 320,
        "stock": 10
    },
    {
        "id": 7,
        "titulo": "Vision PRO",
        "descripcion": "El Vision Pro es un dispositivo de realidad virtual avanzado que ofrece una experiencia inmersiva y envolvente. Con su diseño ergonómico y tecnología de vanguardia, proporciona una visualización de alta calidad y un seguimiento preciso para una experiencia de VR excepcional.",
        "categoria": "vision-pro",
        "imagen": "/src/data/img/visionpro.webp",
        "precio": 5000,
        "stock": 10
    },
    {
        "id": 8,
        "titulo": "Ipad AIR",
        "descripcion": "El iPad Air es una tablet versátil que combina potencia y portabilidad. Con su diseño delgado y ligero, pantalla Retina de alta resolución y potente chip A14 Bionic, es perfecto para tareas cotidianas, entretenimiento y productividad.",
        "categoria": "ipad",
        "imagen": "/src/data/img/ipadair.webp",
        "precio": 2000,
        "stock": 10
    },
    {
        "id": 9,
        "titulo": "Macbook AIR PRO",
        "descripcion": "El MacBook Air Pro es una computadora portátil diseñada para usuarios profesionales y creativos. Ofrece un rendimiento potente, una pantalla Retina brillante, un teclado cómodo y una batería de larga duración. Es ideal para trabajar con aplicaciones exigentes y multitarea intensiva.",
        "categoria": "macbook",
        "imagen": "/src/data/img/macbookairpro.webp",
        "precio": 1900,
        "stock": 10
    },
    {
        "id": 10,
        "titulo": "Apple Watch",
        "descripcion": "El Apple Watch es un reloj inteligente avanzado que combina estilo y funcionalidad. Ofrece características como monitoreo de la salud, seguimiento de la actividad física, notificaciones en tiempo real y aplicaciones personalizadas. Es un compañero ideal para mantenerse conectado y saludable en el día a día.",
        "categoria": "watch",
        "imagen": "/src/data/img/applewatch.webp",
        "precio": 400,
        "stock": 10
    }
]